#შექმენით კლასი Book. განუსაზღვრეთ ინიციალიზაციის ფუნქცია. განუსაზღვრეთ შემდეგი ატრიბუტები:
# სახელი, ავტორი, გამოშვების წელი, გვერდების რაოდენობა. განუსაზღვრეთ მეთოდი info, რომელიც
# კარგად წაკითხვად ფორმატში დააბრუნებს წიგნის შესახებ ინფორმაციას. დაიცავით ენკაფსულაციის პრინციპი.
# შექმენით Book კლასის რამდენიმე ობიექტი და აჩვენეთ რომ კლასის ფუნქციონალი გამართულად მუშაობს.


class Book:
    def __init__(self, name, authot, year, pages):
        self.__name = name
        self.__author = authot
        self.__year = year
        self.__pages = pages

    def info(self):
        print(f"წიგნის სახელია {self.__name} , მისი ავტორია {self.__author} "
              f", დაწერილია {self.__year} წელს და შედგება {self.__pages} გვერდისგან")


book1 = Book("სახლი", "გიორგი", 1798, 232)
book2 = Book(5, 6, 7, 8)

book1.info()
